<template>
  <section class="privacy-policy">
    <h1>Политика конфиденциальности</h1>
    <p>Настоящая Политика конфиденциальности персональных данных действует в отношении всей информации, которую сайт Conspectus, расположенный на доменном имени <strong>conspectus.vercel.app</strong>, может получить о Пользователе во время использования сайта <strong>conspectus.vercel.app</strong></p>
    <h2>Сбор и использование персональных данных</h2>
    <p>Мы собираем и используем ваши персональные данные только в случае вашего добровольного согласия. При согласии с этим вы разрешаете нам собирать и использовать следующие данные: имя и электронная почта. </p>
    <h2>Хранение данных, изменение и удаление</h2>
    <p>Пользователь, предоставивший свои персональные данные сайту <strong>conspectus.vercel.app</strong> имеет право на их изменение и удаление, а так же на отзыв своего согласия с их использованием. Для доступа к своим персональным данным вы можете связаться с администрацией сайта по следующему адресу: <strong>ira.swenlii@gmail.com</strong>. Мы можем передавать ваши личные данные третьей стороне только с вашего добровольного согласия, если они были переданы, то изменение данных в других организациях, не связанных с нами, мы осуществить не можем.</p>
    <h2>Использование технических данных при посещении сайта</h2>
    <p>При посещении вами сайта <strong>swenlii.up.railway.app</strong> мы не храним любую техническую информацию.</p>
    <h2>Какие данные вы собираете?</h2>
    <p>Когда посетители оставляют комментарии на сайте, мы собираем данные, указанные в форме комментариев.</p>
    <p>При подписке на новости сайта мы сохраняем в базе данных ваш email для удобства автоматической рассылки новостей сайта нашим подписчикам.</p>
    <p>При использовании формы контакта вы даете согласие на обработку и использование нами вашей информации. Мы не сохраняем на сайте любую введенную вами в данной форме информацию. Вся информация, введенная вами, будет отправлена Администратору сайта, который может использовать информацию по своему усмотрению.</p>
    <p>Мы так же собираем статистику посещаемости наших статей, никакую вашу личную информацию мы не собираем кроме самого факта посещения вами определенной статьи.</p>
    <h2>Файлы Cookie</h2>
    <p>Если вы оставляете комментарий на нашем сайте, вы можете разрешить сохранение своего имени в файлах cookie. Это сделано для вашего удобства, чтобы вам не приходилось снова вводить свои данные, когда вы оставляете другой комментарий. Эти файлы cookie будут храниться в течение одного года.</p>
    <p>Когда вы кликаете на статьи в руководствах, находящихся по адресам <code>/guide/*название руководства*</code> мы сохраняем идентификатор этой статьи в ваш прогресс чтения данного руководства и посещенных статей. Это сделано для вашего удобства, чтобы отображать ваш процент прохождения учебника на нашем сайте. Cookie прогресса руководств и посещаемости сохраняются сроком на один год.</p>
    <p>При смене темы сайта мы сохраняем ваши предпочтения в файлах cookie сроком на 1 год.</p>
    <p>При любом посещении статьи мы сохраняем ваше посещение в базе данных в счетчике посещений этой статьи, а так же сохраняем ваше посещение в файлы cookie сроком на 1 год. Это сделано для сбора статистики популярности и посещаемости наших статей, и таким образом ваше повторное посещение не засчитается за новое посещение.</p>
    <h2>Контент с других веб-сайтов</h2>
    <p>Статьи на этом сайте могут включать встроенный контент (например, ссылки, видео, изображения, статьи и т. д.). Встроенный контент с других веб-сайтов ведет себя точно так же, как если бы посетитель посетил другой веб-сайт.</p>
    <p>Эти веб-сайты могут собирать данные о вас, использовать файлы cookie, внедрять дополнительное стороннее отслеживание и отслеживать ваше взаимодействие с этим встроенным содержимым, включая отслеживание вашего взаимодействия со встроенным содержимым, если у вас есть учетная запись и вы вошли на этот веб-сайт.</p>
    <p>При посещении веб сайта по ссылке, указанной на данном сайте, мы не несем ответственность за их содержание. Мы рекомендуем вам ознакомиться с политикой конфиденциальности каждого сайта, который вы посещаете, если она там есть.</p>
    <h2>Кому мы отправляем ваши данные</h2>
    <p>Мы не передаем персональные данные другим организациям и службам, не указанным в данной политике конфиденциальности. Исключение составляет только передача информации при законных требованиях государственных органов уполномоченных осуществлять данные действия.</p>
    <h2>Как долго мы храним ваши данные</h2>
    <p>Если вы оставляете комментарий, он и его метаданные сохраняются на неопределенный срок. Это сделано для того, чтобы мы могли автоматически распознавать и одобрять любые последующие комментарии, а не держать их в очереди на модерацию.</p>
    <p>Все остальные данные, указанные в данной политике конфиденциальности, хранятся сроком ровно 1 год и удаляются по истечению года Администраторами сайта.</p>
    <h2>Какие права у вас есть на ваши данные</h2>
    <p>Если у вас есть учетная запись на этом сайте или вы оставили комментарии, вы можете запросить получение экспортированного файла личных данных, которые мы храним о вас, включая любые данные, которые вы нам предоставили. Вы также можете потребовать, чтобы мы удалили все ваши личные данные, которые мы храним. Сюда не входят данные, которые мы обязаны хранить в административных, юридических целях или в целях безопасности.</p>
    <h2>Предоставление информации детьми</h2>
    <p>Если Вы являетесь родителем или опекуном, и вы знаете, что ваши дети предоставили нам свои личные данные без Вашего согласия, свяжитесь с нами: <strong>ira.swenlii@gmail.com</strong>. На нашем сервисе запрещено оставлять личные данные несовершеннолетних без согласия родителей или опекунов.</p>
    <h2>Изменения в политике конфиденциальности</h2>
    <p>Наш сайт <strong>conspectus.vercel.app</strong> может обновлять нашу политику конфиденциальности время от времени. Мы сообщаем о любых изменениях, разместив новую политику конфиденциальности на этой странице. Мы отслеживаем изменения законодательства, касающегося персональных данных в Европейском Союзе и в Российской Федерации. Если вы оставили персональные данные у нас, то мы оповестим вас об изменении в политике конфиденциальности. Если ваши персональные данные были введены не корректно, то мы не сможем с вами связаться.</p>
    <h2>Обратная связь, заключительные положения</h2>
    <p>Связаться с администрацией сайта <strong>conspectus.vercel.app</strong> по вопросам, связанным с политикой конфиденциальности можно по адресу: <strong>ira.swenlii@gmail.com</strong>, либо с помощью контактной формы указанной в соответствующем разделе данного сайта. Если вы не согласны с данной политикой конфиденциальности, вы не можете пользоваться услугами сайта <strong>conspectus.vercel.app</strong>, в этом случае вы должны воздержаться от посещения нашего сайта.</p>
  </section>
</template>

<script>
export default {
  name: "privacy-policy",
  data: function () {
    return {
      
    }
  },
  head() {
    return {
      title: 'Политика конфиденциальности - Conspectus',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: 'Настоящая Политика конфиденциальности персональных данных действует в отношении всей информации, которую сайт Conspectus, расположенный...'
        },
        {
          hid: 'keywords',
          name: 'keywords',
          content: 'личный, блог, разработка, политика, конфиденциальности'
        }
      ],
    };
  },
}
</script>

<style lang="scss" scoped>
@import '~assets/styles/variables.scss';

.privacy-policy {
    padding: 1em;
    max-width: 1000px;
    
    margin: 1em auto 0 auto;    
}

p {
  font-size: 18px;
}

code {
  font-size: 0.8em;
}
</style>