let code = `

<div>
  <p>
    123Таким образом, реализация намеченного плана развития играет важную роль в формировании
    системы масштабного изменения ряда параметров. Задача организации, в особенности же
    дальнейшее развитие различных форм деятельности напрямую зависит от
    <span class="tooltip"
          tooltip="Экономическая целесообразность — наука, затрагивающая экономику,
              представляющая собой экономику, цель и образованность. Просто это не наука,
              а слова-рыба, и такой науки, естественно не существует. тем не менее, тект здесь
              нужен и значительно много для примера. Поэтому немного лишних слов не помешает.">
          экономической</span>  целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный
    рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <h2 id="art-point-1" class="art-point">Первая глава. Начинаем!</h2>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <div class="note">
    <div>
      <img src="/images/icons/pencil.png">
    </div>
    <div>
      <span>На заметку</span>
      <p>В <i>CSS</i>  можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного <i>CSS</i> свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как <a href="https://bennettfeely.com/clippy/">Clippy</a></p>
    </div>
  </div>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <h4 id="art-point-2" class="art-point">Вот как выглядит цитата!</h4>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <blockquote>
    <p>Пережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.</p>
    <cite>Чак Паланик, "Бойцовский клуб"</cite>
  </blockquote>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <h2 id="art-point-3" class="art-point">Вторая глава. Списки с списки.</h2>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача <span class="tooltip" tooltip="Организа́ция (от греч. ὄργανον — «инструмент») — группа людей, деятельность которых сознательно координируется для достижения общих целей.">организации</span>, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <h5 id="art-point-4" class="art-point">Список первый. Используем квадратики.</h5>
  <ul>
    <li>При переключении на <span class="tooltip" tooltip="язык">категорию</span> или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..</li>
    <li>Нужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)</li>
    <li>Материалы для библиотеки и отображение их в библиотеке</li>
    <li>Отображение статьи по ссылке</li>
    <li>Выделение прочитанного в гайдах при наведении на счетчик</li>
    <li>У h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.</li>
  </ul>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <h5 id="art-point-5" class="art-point">Список второй. Добавим цифры.</h5>
  <ol>
    <li>При переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..</li>
    <li>Нужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)</li>
    <li>Материалы для библиотеки и отображение их в библиотеке</li>
    <li>
      <div>
        Отображение статьи по ссылке
        <ol>
          <li>Код статьи где-то хранится. Либо БД, либо json. Еще не знаю.</li>
          <li>Так же нужно, чтоб в статье были только те элементы, что уже стилизованны.</li>
          <li>Допустим вот:
            <ol>
              <li>Коротко 1</li>
              <li>Коротко 2</li>
              <li>Коротко 3</li>
            </ol>
          </li>
          <li>Нужно сделать для начала 3 статьи. А потом уже больше.</li>
        </ol>
      </div>
    </li>
    <li>Выделение прочитанного в гайдах при наведении на счетчик</li>
    <li>У h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.</li>
  </ol>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <h2 id="art-point-6" class="art-point">Глава номер три. Кажется мне нужно больше черного!</h2>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <h4 id="art-point-7" class="art-point">Код и карты!</h4>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <div class="warning">
    <div>
      <img src="/images/icons/info.png" alt="">
    </div>
    <div>
      <span>Важно!</span>
      <p>Это сообщение о каком-то важном событии. Например "Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!"</p>
    </div>
  </div>
  <p>Дорогие друзья, <code class="inline-code">function nameFunction () {...}</code> консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code class="inline-code">&lt;code&gt;</code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <div class="cards">
    <div class="card"><b>Название карты</b> <span>Описание карточки. Например, тег служит для того, чтобы вот и вот.</span> </div>
    <div class="card"><b>Название карты</b> <span>Описание карточки. Например, тег служит для того, чтобы вот и вот.</span> </div>
    <div class="card"><b>Название карты</b> <span>Описание карточки. Например, тег служит для того, чтобы вот и вот.</span> </div>
    <div class="card"><b>Название карты</b> <span>Описание карточки. Например, тег служит для того, чтобы вот и вот.</span> </div>
  </div>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <div class="lang-name">Java Script</div>
  <pre><code class="language-java">let articlee = Vue.component(&#x27;articlee&#x27;, ({
    name: &#x27;articlee&#x27;,
    template: &#x60;...&#x60;,
    methods: {
        // some functions here
      }
    },
    mounted() {
        this.createTooltips();
    }
}));</code></pre>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
  <h5 id="art-point-8" class="art-point">Таблица везде сгодится</h5>
  <h5 id="art-point-9" class="art-point">Таблица везде сгодится</h5>
  <h3 id="art-point-10" class="art-point">Таблица везде сгодится</h3>
  <p>Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!</p>
  <table class="table">
    <thead>
    <tr>
      <td>Код</td>
      <td>Символ</td>
      <td>Описание</td>
    </tr>
    </thead>
    <tbody>
    <tr><td>& lt;</td>     <td>&lt;</td>      <td>меньше</td></tr>
    <tr><td>& gt;</td>     <td>&gt;</td>      <td>больше</td></tr>
    <tr><td>& amp;</td>    <td>&amp;</td>     <td>амперсанд</td></tr>
    <tr><td>& nbsp;</td>   <td>&nbsp;</td>    <td>неразрывный пробел (на этом пробеле строка не разрывается для переноса)</td></tr>
    <tr><td>& sect;</td>   <td>&sect;</td>    <td>параграф</td></tr>
    <tr><td>& #8470;</td>  <td>№</td>   <td>№	номер</td></tr>
    <tr><td>& copy;</td>   <td>&copy;</td>    <td>копирайт (copyright)</td></tr>
    <tr><td>& reg;</td>    <td>&reg;</td>     <td>зарегистрированный товарный знак (registered trademark)</td></tr>
    <tr><td>& #153;</td>   <td>™</td>    <td>товарный знак(trademark)</td></tr>
    <tr><td>& deg;</td>    <td>&deg;</td>     <td>градусы</td></tr>
    <tr><td>& laquo;</td>  <td>&laquo;</td>   <td>открывающая кавычка в русском языке</td></tr>
    <tr><td>& raquo;</td>  <td>&raquo;</td>   <td>закрывающая кавычка в русском языке</td></tr>
    <tr><td>& hellip;</td> <td>&hellip;</td>  <td>многоточие</td></tr>
    <tr><td>& mdash;</td>  <td>&mdash;</td>   <td>тире</td></tr>
    <tr><td>& #149;</td>   <td>•</td>    <td>жирная точка</td></tr>
    <tr><td>& plusmn;</td> <td>&plusmn;</td>  <td>плюс-минус</td></tr>
    <tr><td>& minus;</td>  <td>&minus;</td>   <td>минус</td></tr>
    </tbody>
    <tfoot>
    <tr><td>121212</td>  <td>343455</td>   <td>fdg4errter</td></tr>
    </tfoot>
  </table>
  <p>Дорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации</p>
  <p>Задача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.</p>
</div>

`; export {code}