let code = `
      <h2 ref="art-point-1">Просто пример</h2> <!-- главные заголовки -->
      
      <p>Около 3 лет опыта работы в области веб-разработки. Имеется серия успешно запущенных иностраных продуктов. Суммарное участие в разработке более 15 проектов, в том числе 3 под мою личную ответственность и 2 pet-проекта. Могу самостоятельно реализовать проект небольшого размера. Основной опыт разработки в области криптовалют, финансов и блокчейна, но так же имеется опыт в области продаж и блогинга. Обожаю такие задачи как: верстка макетов, разработка системы компонентов на Vue, рефакторинг кода, разработка анимации.</p>

<h5 ref="art-point-5">Список №1</h5>
      <ul>
        <li>пункт 1</li>
        <li>пункт 1</li>
      </ul>
      
      <p>Около 3 лет опыта работы в области веб-разработки. Имеется серия успешно запущенных иностраных продуктов. Суммарное участие в разработке более 15 проектов, в том числе 3 под мою личную ответственность и 2 pet-проекта. Могу самостоятельно реализовать проект небольшого размера. Основной опыт разработки в области криптовалют, финансов и блокчейна, но так же имеется опыт в области продаж и блогинга. Обожаю такие задачи как: верстка макетов, разработка системы компонентов на Vue, рефакторинг кода, разработка анимации.</p>

      <blockquote>
        <p>Цитата</p>
        <cite>Откуда</cite>
      </blockquote>
      
      <p>Около 3 лет опыта работы в области веб-разработки. Имеется серия успешно запущенных иностраных продуктов. Суммарное участие в разработке более 15 проектов, в том числе 3 под мою личную ответственность и 2 pet-проекта. Могу самостоятельно реализовать проект небольшого размера. Основной опыт разработки в области криптовалют, финансов и блокчейна, но так же имеется опыт в области продаж и блогинга. Обожаю такие задачи как: верстка макетов, разработка системы компонентов на Vue, рефакторинг кода, разработка анимации.</p>
      
      
      

      `; export {code}