const {query} = require("./db-connect");

async function getall() {
  return [
    {
      "id": "art-1",
      "title": "Рыбатекст",
      "desc": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
      "date": "31 февраля",
      "file": "usually-art.vue",
      "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
      "img": "image-1.jpg",
      "lib": true,
      "cats": [
        {
          "link": "html",
          "text": "HTML"
        },
        {
          "link": "basics",
          "text": "Общие понятия"
        },
        {
          "link": "semantics",
          "text": "Семантика"
        }
      ],
      "tags": [
        "Просто",
        "Рандом",
        "Основы"
      ],
      "dopcon": false,
      "simarts": [
        {
          "id": "art-12",
          "title": "Литература спасет душу",
          "desc": "Читать книги полезно!"
        },
        {
          "id": "art-132",
          "title": "HTML - язык разметки",
          "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
        }
      ],
      "comms": [
        {
          "user": "Сергей Алексеевич",
          "text": "Полезная статья"
        },
        {
          "user": "Желтая ведьма",
          "text": "Ничего не понятно, но очень интересно"
        }
      ]
    },
    {
      "id": "art-2",
      "title": "Семантика",
      "desc": "Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа. Даже в этой статье есть заголовки разных уровней — это помогает читателю выстроить в голове структуру документа. Так и на странице сайта — только читатели будут немного другими.",
      "date": "26 ноября",
      "file": "temple-art.vue",
      "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
      "img": "image-2.jpg",
      "lib": true,
      "cats": [
        {
          "link": "html",
          "text": "HTML"
        },
        {
          "link": "basics",
          "text": "Общие понятия"
        },
        {
          "link": "semantics",
          "text": "Семантика"
        }
      ],
      "tags": [
        "HTML",
        "HTML5",
        "Основы"
      ],
      "dopcon": true,
      "dopconarr": [
        {
          "type": "contlist",
          "name": "Содержание",
          "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
        },
        {
          "type": "html",
          "name": "Заметки",
          "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
        },
        {
          "type": "html",
          "name": "Термины",
          "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
        },
        {
          "type": "html",
          "name": "История",
          "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
        },
        {
          "type": "test",
          "name": "Самопроверка",
          "html": "",
          "quests": [
            {
              "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
              "type": "select",
              "answers": [
                "charset",
                "content-type",
                "http-equiv",
                "content"
              ],
              "trueansw": "http-equiv"
            },
            {
              "text": "Какие теги можно помещать в тег &lt;head&gt;?",
              "type": "checkbox",
              "answers": [
                "meta",
                "html",
                "header",
                "script",
                "strong",
                "link",
                "title",
                "address",
                "base"
              ],
              "trueansw": [
                "meta",
                "html",
                "script",
                "link",
                "title",
                "base"
              ]
            },
            {
              "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
              "type": "input",
              "trueansw": "flex-direction"
            },
            {
              "text": "Назови общие слова для всех свойств CSS.",
              "type": "details",
              "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
            }

          ]
        }
      ],
      "simarts": [
        {
          "id": "id-art-1",
          "title": "Почему z-index не работает?",
          "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
        },
        {
          "id": "art-132",
          "title": "HTML - язык разметки",
          "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
        }
      ],
      "comms": [
        {
          "user": "user 31",
          "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
        },
        {
          "user": "user 32",
          "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
        },
        {
          "user": "user 33",
          "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
        },
        {
          "user": "user 34",
          "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
        }
      ]
    },
  ];
}

async function index() {
  let arts = await query('SELECT *, DATE_FORMAT(date, "%d.%m.%Y") AS date2 FROM articles');
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается на смысловое предназначение каждого блока",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается на смысловое предназначение каждого блока",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается на смысловое предназначение каждого блока",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа. Даже в этой статье есть заголовки разных уровней — это помогает читателю выстроить в голове структуру документа. Так и на странице сайта — только читатели будут немного другими.",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": false,
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается на смысловое предназначение каждого блока",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа. Даже в этой статье есть заголовки разных уровней — это помогает читателю выстроить в голове структуру документа. Так и на странице сайта — только читатели будут немного другими.",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается на смысловое предназначение каждого блока",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа. Даже в этой статье есть заголовки разных уровней — это помогает читателю выстроить в голове структуру документа. Так и на странице сайта — только читатели будут немного другими.",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  arts.push({
    "id": "art-1",
    "title": "Рыбатекст",
    "description": "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    "date": "31 февраля",
    "file": "usually-art.vue",
    "content": "Разнообразный и богатый опыт реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры влечет за собой процесс внедрения и модернизации форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа существенных финансовых и административных условий. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nПовседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации.\n\nРазнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом рамки и место обучения кадров играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют от нас анализа новых предложений.\n\nНе следует, однако забывать, что рамки и место обучения кадров представляет собой интересный эксперимент проверки систем массового участия. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития. Не следует, однако забывать, что рамки и место обучения кадров позволяет оценить значение системы обучения кадров, соответствует насущным потребностям.\n\nС другой стороны реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации систем массового участия.\n\nИдейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения новых предложений. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание направлений прогрессивного развития. Товарищи! новая модель организационной деятельности требуют определения и уточнения форм развития.\n\nНе следует, однако забывать, что реализация намеченных плановых заданий представляет собой интересный эксперимент проверки новых предложений. С другой стороны рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! рамки и место обучения кадров требуют от нас анализа систем массового участия.",
    "img": "image-1.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "Просто",
      "Рандом",
      "Основы"
    ],
    "dopcon": false,
    "simarts": [
      {
        "id": "art-12",
        "title": "Литература спасет душу",
        "desc": "Читать книги полезно!"
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "Сергей Алексеевич",
        "text": "Полезная статья"
      },
      {
        "user": "Желтая ведьма",
        "text": "Ничего не понятно, но очень интересно"
      }
    ]
  });
  arts.push({
    "id": "art-2",
    "title": "Семантика",
    "description": "Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа. Даже в этой статье есть заголовки разных уровней — это помогает читателю выстроить в голове структуру документа. Так и на странице сайта — только читатели будут немного другими.",
    "date": "26 ноября",
    "file": "temple-art.vue",
    "content": "123Таким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nПервая глава. Начинаем!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\n\nНа заметку\nВ CSS можно вырезать абсолютно любую фигуру из предоставленных нам прямоугольников. Только работает это именно как ножницы. Просто отрезается все лишнее. Код у данного CSS свойства довольно сложное даже для профессионалов. Особенно если нужно создать сложную фигуру. Именно для этого существуют онлайн-инструменты, такие как Clippy\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nВот как выглядит цитата!\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nПережить можно всё — даже самую страшную боль. Только тебе нужно что-то, что будет тебя отвлекать.\n\nЧак Паланик, \"Бойцовский клуб\"\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nВторая глава. Списки с списки.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок первый. Используем квадратики.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nСписок второй. Добавим цифры.\nПри переключении на категорию или тег теги и категории пересчитываются. То есть если в новом запросе тегов всего 4, то показываются только они..\nНужно, чтоб фильтры сохранялись при перезагрузке, а так же чтоб фильтры отображались в адресе страницы (чтоб фильтруемую страницу можно было сохранить в закладки, а для отмены последнего фильтра нажать назад)\nМатериалы для библиотеки и отображение их в библиотеке\nОтображение статьи по ссылке\nКод статьи где-то хранится. Либо БД, либо json. Еще не знаю.\nТак же нужно, чтоб в статье были только те элементы, что уже стилизованны.\nДопустим вот:\nКоротко 1\nКоротко 2\nКоротко 3\nНужно сделать для начала 3 статьи. А потом уже больше.\nВыделение прочитанного в гайдах при наведении на счетчик\nУ h1 есть before, который гораздо больше своего родителя, но бледный и сзади текста. Я постаралась сделать так, чтобы он никогда не закрывал соседние элементы.\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nГлава номер три. Кажется мне нужно больше черного!\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nКод и карты!\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\n\nВажно!\nЭто сообщение о каком-то важном событии. Например \"Запомни! Никогад не оставляй газ без присмотра, а утюг не выключенным!\"\n\nДорогие друзья, function nameFunction () {...} консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны <code> сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nНазвание карты\nОписание карточки. Например, тег служит для того, чтобы вот и вот.\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nJava Script\nlet articlee = Vue.component('articlee', ({\n    name: 'articlee',\n    template: `...`,\n    methods: {\n        // some functions here\n      }\n    },\n    mounted() {\n        this.createTooltips();\n    }\n}));\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.\n\nТаблица везде сгодится\nТаблица везде сгодится\nТаблица везде сгодится\nТаким образом, реализация намеченного плана развития играет важную роль в формировании системы масштабного изменения ряда параметров. Задача организации, в особенности же дальнейшее развитие различных форм деятельности напрямую зависит от экономической целесообразности принимаемых решений. Соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующих условий активизации!\n\nКод\tСимвол\tОписание\n& lt;\t<\tменьше\n& gt;\t>\tбольше\n& amp;\t&\tамперсанд\n& nbsp;\t \tнеразрывный пробел (на этом пробеле строка не разрывается для переноса)\n& sect;\t§\tпараграф\n& #8470;\t№\t№ номер\n& copy;\t©\tкопирайт (copyright)\n& reg;\t®\tзарегистрированный товарный знак (registered trademark)\n& #153;\t™\tтоварный знак(trademark)\n& deg;\t°\tградусы\n& laquo;\t«\tоткрывающая кавычка в русском языке\n& raquo;\t»\tзакрывающая кавычка в русском языке\n& hellip;\t…\tмноготочие\n& mdash;\t—\tтире\n& #149;\t•\tжирная точка\n& plusmn;\t±\tплюс-минус\n& minus;\t−\tминус\n121212\t343455\tfdg4errter\nДорогие друзья, консультация с профессионалами из IT способствует подготовке и реализации соответствующих условий активизации\n\nЗадача организации, в особенности же постоянное информационно-техническое обеспечение нашей деятельности обеспечивает актуальность ключевых компонентов планируемого обновления. Таким образом, сложившаяся структура организации требует от нас системного анализа модели развития! С другой стороны сложившаяся структура организации требует определения и уточнения системы масштабного изменения ряда параметров.",
    "img": "image-2.jpg",
    "lib": true,
    "cats": [
      {
        "link": "html",
        "text": "HTML"
      },
      {
        "link": "basics",
        "text": "Общие понятия"
      },
      {
        "link": "semantics",
        "text": "Семантика"
      }
    ],
    "tags": [
      "HTML",
      "HTML5",
      "Основы"
    ],
    "dopcon": true,
    "dopconarr": [
      {
        "type": "contlist",
        "name": "Содержание",
        "list": [{"margin":0,"id":"art-point-1","text":"Первая глава. Начинаем!"},{"margin":2,"id":"art-point-2","text":"Вот как выглядит цитата!"},{"margin":0,"id":"art-point-3","text":"Вторая глава. Списки с списки."},{"margin":3,"id":"art-point-4","text":"Список первый. Используем квадратики."},{"margin":3,"id":"art-point-5","text":"Список второй. Добавим цифры."},{"margin":0,"id":"art-point-6","text":"Глава номер три. Кажется мне нужно больше черного!"},{"margin":2,"id":"art-point-7","text":"Код и карты!"},{"margin":3,"id":"art-point-8","text":"Таблица везде сгодится"},{"margin":3,"id":"art-point-9","text":"Таблица везде сгодится"},{"margin":1,"id":"art-point-10","text":"Таблица везде сгодится"}]
      },
      {
        "type": "html",
        "name": "Заметки",
        "html": "рандомный контент (прокручивается отдельно):<br>- картинка<br>- содержание документа<br>- схемы<br>- код<br>- литература по теме<br>- какие-то характеристики<br>- история (например история языка)<br>- термины<br>- вопросы и тест<br>- оставить заметку<br>и прочее...<br>"
      },
      {
        "type": "html",
        "name": "Термины",
        "html": "<dl>\n        <dt>Термин 1</dt>\n        <dd>Определение термина 1</dd>\n        <dt>Термин 2</dt>\n        <dd>Определение термина 2</dd>\n        <dt>GIF</dt>\n        <dd>Формат графических файлов, широко применяемый при создании сайтов.\n        GIF использует 8-битовый цвет и эффективно сжимает сплошные цветные области,\n        при этом сохраняя детали изображения.</dd>\n        <dt>JPEG</dt>\n        <dd>Популярный формат графических файлов, широко применямый при создании\n        сайтов и хранения изображений. JPEG поддерживает 24-битовый цвет и сохраняет\n        яркость и оттенки цветов в фотографиях. Данный формат называют сжатием с потерями,\n        поскольку алгоритм JPEG выборочно отвергает данные. Метод сжатия может исказить\n        деталь в рисунке, особенно содержащий текст или изображение с четкими краями.\n        Формат JPEG не поддерживает прозрачность, когда вы сохраняете фотографию в формате\n        JPEG, прозрачные пиксели заполняются определенным цветом.</dd>\n        <dt>HTML</dt>\n        <dd>(от англ. Hyper Text Markup Language — «язык разметки гипертекста») язык разметки гипертекста в интернете. HTML-страницы передаются от сервера браузерам с помощью протоколов HTTP или HTTPS в виде простого текста или с использованием шифрования. Браузеры интерпретируют код HTML в удобочитаемый для пользователей документ, который отображается на экране устройства. Язык получил широкое распространение и используется при создании большинства сайтов.</dd>\n        </dl>"
      },
      {
        "type": "html",
        "name": "История",
        "html": "<p>Язык HTML был создан Тимом Бернерсом-Ли в 1990-х годах. Изначально HTML использовался исключительно как инструмент для форматирования и обмена документацией пользователями, которые не имели навыков верстки. Главной функцией первой версии HTML было корректное, без каких-либо структурных искажений, воспроизведение текста на различных устройствах вывода информации.</p>\n\n        <p>За прошедшее время HTML претерпел существенные изменения, в нем значительно расширились возможности верстки документов. Язык имеет несколько версий:</p>\n\n        <ul>\n        <li>Первые версии HTML — начало 90-х годов. Спецификаций не существует, так как единого официального стандарта языка на тот момент не было. Язык был ориентирован только на обработку текста и применение к нему атрибутов — жирный текст, курсив etc.</li>\n        <li>HTML 2.0 — появилась поддержка форм.</li>\n        <li>HTML 3.2 — появилась возможность создания таблиц, отображение математических формул, эффект обтекания изображений.</li>\n        <li>HTML 4.0 — были отменены некоторые элементы HTML, взамен которых было предложено использовать таблицы стилей CSS. Была добавлена поддержка скриптов и фреймов.</li>\n        <li>HTML 4.01 — доработанная версия 4.0.</li>\n        <li>HTML 5 — 2010-й год — нынешнее время. Предпочтительная версия для создания современных сайтов: поддерживает мультимедиа-технологии и позволяет описать видео и графические объекты только за счет HTML-кода — без использования сторонних плагинов, обогащает семантическое содержание документа.</li>\n        </ul>"
      },
      {
        "type": "test",
        "name": "Самопроверка",
        "html": "",
        "quests": [
          {
            "text": "Какой атрибут отвечает за дополнительную информацию о странице?",
            "type": "select",
            "answers": [
              "charset",
              "content-type",
              "http-equiv",
              "content"
            ],
            "trueansw": "http-equiv"
          },
          {
            "text": "Какие теги можно помещать в тег &lt;head&gt;?",
            "type": "checkbox",
            "answers": [
              "meta",
              "html",
              "header",
              "script",
              "strong",
              "link",
              "title",
              "address",
              "base"
            ],
            "trueansw": [
              "meta",
              "html",
              "script",
              "link",
              "title",
              "base"
            ]
          },
          {
            "text": "Какое свойство CSS отвечает за перенос элементов в flex элементе?",
            "type": "input",
            "trueansw": "flex-direction"
          },
          {
            "text": "Назови общие слова для всех свойств CSS.",
            "type": "details",
            "trueansw": "<ul>\n            <li><code>all: revert</code> - ключевое слово <code>all</code> применяется сразу ко всем свойствам элемента</li>\n            <li><code>border: inherit</code> - слово <code>inherit</code> заставит элемент унаследовать свойство его родителя (если у родителя нет, поднимается выше вплоть до браузерных стилей). Применяется к ненаследуемым свойствам.</li>\n            <li><code>border: initial</code> - слово <code>initial</code> установит значение по умолчанию для элемента HTML, определённое в спецификации CSS</li>\n            <li><code>all: unset</code> - слово <code>unset</code> работает в основном с <code>all</code>. сбрасывает свойство (если наследуется, то как <code>inherit</code>, если нет, то как <code>initial</code>)</li>\n            <li><code>border: revert</code>  - слово <code>revert</code> сбрасывает до стилей браузера (не до спецификации CSS). Может применятся к <code>all</code>.</li>\n            <li><code>color: black !important</code> - слово <code>!important</code> заставляет применить именно это свойство к элементу, даже если есть свойство большей специфичности, чем это. Рекомендуется использовать как можно реже, чтоб избежать путанницы</li>\n            </ul>"
          }

        ]
      }
    ],
    "simarts": [
      {
        "id": "id-art-1",
        "title": "Почему z-index не работает?",
        "desc": "Иногда z-index может не работать по неявным причинам. Какой-то элемент все равно выше всех остальных даже с интексом -1. Давайте разберемся, почему так бывает, на примерах."
      },
      {
        "id": "art-132",
        "title": "HTML - язык разметки",
        "desc": "HTMl - язык для отрисовки сайта. С помощью него вы говрите отрисовать браузеру кнопки, текст, заголовки и др."
      }
    ],
    "comms": [
      {
        "user": "user 31",
        "text": "Это коментарий №1. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 32",
        "text": "Это коментарий №2. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 33",
        "text": "Это коментарий №3. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      },
      {
        "user": "user 34",
        "text": "Это коментарий №4. \nКомментарии созданы для взаимодействия блоггера с его аудиторией. Для этого он пишет статьи, а мы отвечаем ему в комментариях, что нам нравится, а что не нравится. Хороший блоггер прислушивается к своей аудитории и отвечает ей, исправляя ошибки и подстраиваясь под аудиторию."
      }
    ]
  });
  return arts;
}

async function comments({id}) {
  return await query(`SELECT * FROM comments WHERE art_id = ?`,[id]);
}

async function get({id}) {

  let art = await query(`SELECT *, DATE_FORMAT(date, '%d.%m.%Y') AS date2 FROM articles WHERE art_id = ?`, [id]);
  return art[0];
}

async function sim_arts({ids}) {
  let sim = [];
  let sims = ids.split(',');
  for(let i = 0; i < sims.length; i++) {
    let ret = await query('SELECT art_id, description AS `desc`, title FROM articles WHERE art_id = ?', [sims[i]]);
    sim.push(ret[0]);
  }
  return sim;
}

async function addPopularity ({id}) {
  await query (`UPDATE articles SET popularity = popularity + 1 WHERE art_id = ?`, [id]);
}

async function last () {
  return await query(`SELECT * FROM articles WHERE date = (SELECT max(date) FROM articles)`);
}

async function best () {
  return await query(`SELECT * FROM articles WHERE popularity = (SELECT max(popularity) FROM articles)`);
}

export {getall, index, comments, get, sim_arts, addPopularity, last, best}
